CSI API ETABS v1
cSapModel.SetProjectInfo Method
 Sets the data for an item in the project information.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetProjectInfo(
	string Item,
	string Data
)
Function SetProjectInfo (
	Item As String,
	Data As String
) As Integer
Dim instance As cSapModel
Dim Item As String
Dim Data As String
Dim returnValue As Integer
returnValue = instance.SetProjectInfo(Item,
	Data)
int SetProjectInfo(
	String^ Item,
	String^ Data
)
abstract SetProjectInfo :
        Item : string *
        Data : string -> int
Parameters
Item
Type: System.String
 The name of the project information item to be set.
Data
Type: System.String
Return Value
Type: Int32
 Returns zero if the data is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set project information data
       ret = SapModel.SetProjectInfo("Company Name", "Computers and Structures, Inc.")
       ret = SapModel.SetProjectInfo("Project Name", "API Testing")
       ret = SapModel.SetProjectInfo("My Item", "My Data")
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cSapModel Interface
ETABSv1 Namespace